#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-terraform-aws-projects-2025/AWS-Image-Labels-Generator/runs/run-y4J6STkAwxE97atq

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
random_id.bucket_id: Refreshing state... [id=BBqopg]
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=142c227bb5b77fba1645051c4e472335ba3ef5e8]
aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/rekognition-image-labels-rekognition-lambda]
aws_iam_group.developer_group: Refreshing state... [id=rekognition-image-labels-developer-group]
aws_iam_policy.rekognition_policy: Refreshing state... [id=arn:aws:iam::871308866502:policy/rekognition-image-labels-rekognition-policy]
aws_secretsmanager_secret.dev_keys: Refreshing state... [id=arn:aws:secretsmanager:ap-southeast-1:871308866502:secret:rekognition-image-labels-dev-credentials-new-KWvEDW]
aws_iam_user.project_user: Refreshing state... [id=rekognition-image-labels-developer-user]
aws_iam_role.lambda_role: Refreshing state... [id=rekognition-image-labels-rekognition-lambda-role]
aws_s3_bucket.images_bucket: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_iam_access_key.project_user_key: Refreshing state... [id=AKIA4VXQOGPDJTJUZ7WX]
aws_iam_group_membership.developer_team: Refreshing state... [id=rekognition-image-labels-group-membership]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=rekognition-image-labels-rekognition-lambda-role-20260118145920640300000002]
aws_secretsmanager_secret_version.dev_keys_val: Refreshing state... [id=arn:aws:secretsmanager:ap-southeast-1:871308866502:secret:rekognition-image-labels-dev-credentials-new-KWvEDW|terraform-20260118161327478900000004]
terraform_data.setup_script: Refreshing state... [id=abf9fa27-e973-270a-4db8-128cf85110b3]
aws_s3_bucket_public_access_block.images_bucket_access: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_s3_bucket_versioning.versioning_images_bucket: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_s3_bucket_server_side_encryption_configuration.sse: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_iam_policy.rekognition_s3_policy: Refreshing state... [id=arn:aws:iam::871308866502:policy/rekognition-image-labels-s3-policy]
aws_lambda_function.rekognition_lambda: Refreshing state... [id=rekognition-image-labels-rekognition-lambda]
aws_s3_bucket_lifecycle_configuration.images_bucket_lifecycle: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_iam_group_policy_attachment.group_attach["arn:aws:iam::871308866502:policy/rekognition-image-labels-s3-policy"]: Refreshing state... [id=rekognition-image-labels-developer-group-20260118161326255600000002]
aws_iam_group_policy_attachment.group_attach["arn:aws:iam::871308866502:policy/rekognition-image-labels-rekognition-policy"]: Refreshing state... [id=rekognition-image-labels-developer-group-20260118161326256600000003]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.lambda_log_group will be destroyed
  # (because aws_cloudwatch_log_group.lambda_log_group is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda_log_group" {
      - arn               = "arn:aws:logs:ap-southeast-1:871308866502:log-group:/aws/lambda/rekognition-image-labels-rekognition-lambda" -> null
      - id                = "/aws/lambda/rekognition-image-labels-rekognition-lambda" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/rekognition-image-labels-rekognition-lambda" -> null
      - retention_in_days = 7 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Name" = "rekognition-image-labels-lambda-log-group"
        } -> null
      - tags_all          = {
          - "Environment" = "Production"
          - "ManagedBy"   = "Terraform"
          - "Name"        = "rekognition-image-labels-lambda-log-group"
          - "Owner"       = "ShenLoong"
          - "Project"     = "rekognition-image-labels"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.lambda_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "lambda_errors" {
      + actions_enabled                       = true
      + alarm_description                     = "This alarm triggers if the Lambda fails to process an image."
      + alarm_name                            = "RekognitionLambdaErrors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "rekognition-image-labels-rekognition-lambda"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "rekognition-image-labels"
        }
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_lambda_function.rekognition_lambda will be updated in-place
  ~ resource "aws_lambda_function" "rekognition_lambda" {
        id                             = "rekognition-image-labels-rekognition-lambda"
      ~ last_modified                  = "2026-01-18T16:49:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "Zj8HBWshpia/pb66OMqCq/yfFHiNtHtzJvciJvi0Cwo=" -> "UtUQHSgEXoxvBKwbUji/Rfmv4k/QwNLU6xiFvBGD17E="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket_metric.bucket_logging will be created
  + resource "aws_s3_bucket_metric" "bucket_logging" {
      + bucket = "rekognition-image-labels-images-bucket-041aa8a6"
      + id     = (known after apply)
      + name   = "EntireBucket"
    }

Plan: 2 to add, 1 to change, 1 to destroy.

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 8 estimated
           $0.300000000000000072/mo +$0.300000000000000072

```

</details>